
### <a href = "#Series"> 1, Series </a>
### 2, Dataframe
### 3, Read data from file
### 4, Get info about data
### 5, Data selection
### 6, Modify data
### 7, Add column using math
### 8, Grouping data and Aggregation 
### 9, Filtering Dataframe
### 10, Concat and append row
### 100, Stuff

### Import module

In [1]:
import numpy as np 
import pandas as pd

# Series and Dataframes

Pandas actually has two data structures, Series and Dataframes. A Dataframe is a two dimensional data structure. It is comprised of rows and columns of data. A Series is the data structure for a single column of a dataframe. Certain pandas operations will return a Series as a standalone data structure.

Both data structures also have an 'index' which uniquely identifies each row. By default, Pandas will assign an integer id as the index, however you can override this and set a column of your choosing as the index (does not have to be an integer) as long as all values in that column are unique.

## <div id = "Series"> 1, Series </div>

In [2]:
data = np.random.rand(5)
a = pd.Series(data, index = ['Math', 'Literature', 'Biology', 'Physics', 'Chemistry'])
a

Math          0.119710
Literature    0.934210
Biology       0.323334
Physics       0.754291
Chemistry     0.797272
dtype: float64

## 2, Dataframes

In [3]:
score = pd.DataFrame(data, columns = ['Score'], index = ['Math', 'Literature', 'Biology', 'Physics', 'Chemistry'])
score

               Score
Math        0.119710
Literature  0.934210
Biology     0.323334
Physics     0.754291
Chemistry   0.797272

### How to create dataframe

In [4]:
# create data from numpy array 
planets_data = np.array([[0.330, 4879, 3.7, 88.0],
            [4.87, 12104, 8.9, 224.7],
            [5.97, 12756, 9.8, 365.2 ],
            [0.642, 6792, 3.7, 687.0],
            [1898, 142984, 23.1, 4331],
            [568, 120536, 9.0, 10747],
            [86.8, 51118, 8.7, 30589],
            [102, 49528, 11.0, 59800]])

# use data to create dataframe
planets = pd.DataFrame(planets_data, 
                  columns=['mass', 'diameter', 'gravity', 'period'],
                  index=['Mercury', 'Venus', 'Earth', 'Mars', 'Jupiter', 'Saturn','Uranus','Neptune'])
planets

             mass  diameter  gravity   period
Mercury     0.330    4879.0      3.7     88.0
Venus       4.870   12104.0      8.9    224.7
Earth       5.970   12756.0      9.8    365.2
Mars        0.642    6792.0      3.7    687.0
Jupiter  1898.000  142984.0     23.1   4331.0
Saturn    568.000  120536.0      9.0  10747.0
Uranus     86.800   51118.0      8.7  30589.0
Neptune   102.000   49528.0     11.0  59800.0

In [5]:
# create data from list, tuples
names = ['Ceres', 'Pluto', 'Haumea', 'Makemake', 'Eris']
distance = [2.77, 39.26, 43.13, 45.79, 68.01]

# ghép 2 list với nhau, kq phải đc ép thành list
sun_distance_data = list(zip(names, distance))

# use data to create dataframe 
sun_distance = pd.DataFrame(sun_distance_data, columns = ['name', 'distance'])
sun_distance

       name  distance
0     Ceres      2.77
1     Pluto     39.26
2    Haumea     43.13
3  Makemake     45.79
4      Eris     68.01

In [6]:
# create data from dict 
club_data = {'player'  :['Lewandoski', 'Arnold', 'Hazard', 'De Bruyne', 'Messi'], 
             'position':['ST', 'RB', 'LW', 'CAM', 'RW']}
club = pd.DataFrame(club_data, index = ['Bayern', 'Liverpool', 'Real', 'Mancity', 'Barca'])
club

               player position
Bayern     Lewandoski       ST
Liverpool      Arnold       RB
Real           Hazard       LW
Mancity     De Bruyne      CAM
Barca           Messi       RW

## 3, Read data from file

In [7]:
# csv_file
solar_system = pd.read_csv('solar_system_abbr.csv', index_col= 0)
# json file
# pd.read_json('path', type = 'series/frame') 
solar_system

                        Type  Order from Sun   Diameter          Mass
Name
Sun                     Star               0  1392000.0  333000.00000
Mercury   Terrestrial planet               1     4878.0       0.05500
Venus     Terrestrial planet               2    12104.0       0.81500
Earth     Terrestrial planet               3    12756.0       1.00000
Mars      Terrestrial planet               4     6787.0       0.10700
Jupiter            Gas giant               6   142800.0     318.00000
Saturn             Gas giant               7   120000.0      95.00000
Uranus             Gas giant               8    51118.0      15.00000
Neptune            Gas giant               9    49528.0      17.00000
Ceres           Dwarf planet               5      974.6       0.00016
Pluto           Dwarf planet              10     2300.0       0.00200
Haumea          Dwarf planet              11     1300.0       0.00070
Makemake        Dwarf planet              12     1420.0       0.00067
Eris            Dwarf planet              13     2326.0       0.00280

## 4, Get information about DataFrame

In [8]:
# basic info: size, data type
print(solar_system.dtypes, '\n')
print(solar_system.shape, '\n')

# min, max, mean, standart deviation, ...
print(solar_system.describe(), '\n') 

# đếm các phần tử giống nhau trong một cột 
print(solar_system['Type'].value_counts())

Type               object
Order from Sun      int64
Diameter          float64
Mass              float64
dtype: object

(14, 4)

       Order from Sun      Diameter           Mass
count         14.0000  1.400000e+01      14.000000
mean           6.5000  1.285923e+05   23817.641666
std            4.1833  3.665235e+05   88988.845412
min            0.0000  9.746000e+02       0.000160
25%            3.2500  2.306500e+03       0.002200
50%            6.5000  9.445500e+03       0.461000
75%            9.7500  5.072050e+04      16.500000
max           13.0000  1.392000e+06  333000.000000

Dwarf planet          5
Gas giant             4
Terrestrial planet    4
Star                  1
Name: Type, dtype: int64

## 5, Data Selection in DataFrame

### Using `iloc`: truy cập bằng chỉ số

In [9]:
solar_system.iloc[6, :]# các columns, index ko đc tính là cột, hàng trong bảng

Type              Gas giant
Order from Sun            7
Diameter             120000
Mass                     95
Name: Saturn, dtype: object

In [10]:
# get row 3 and 8 
solar_system.iloc[[3, 8], :]

                       Type  Order from Sun  Diameter  Mass
Name
Earth    Terrestrial planet               3   12756.0   1.0
Neptune           Gas giant               9   49528.0  17.0

In [ ]:
### Using `loc`: để truy cập df bằng index or column
Tuy nhiên phải duyệt cả df để tìm

In [106]:
solar_system.loc[solar_system['Diameter'] > 5000, ['Diameter', 'Type', 'Mass']]
#solar_system.loc[['Venus', 'Sun'], :]

          Diameter                Type        Mass
Name
Sun      1392000.0                Star  333000.000
Venus      12104.0  Terrestrial planet       0.815
Earth      12756.0  Terrestrial planet       1.000
Mars        6787.0  Terrestrial planet       0.107
Jupiter   142800.0           Gas giant     318.000
Saturn    120000.0           Gas giant      95.000
Uranus     51118.0           Gas giant      15.000
Neptune    49528.0           Gas giant      17.000

### Using `ix`: kết hợp cả hai 
Khá dễ gây confuse khi index, columns là số nguyên

In [105]:
solar_system.ix['Earth': 'Pluto', 1:2]

         Order from Sun
Name
Earth                 3
Mars                  4
Jupiter               6
Saturn                7
Uranus                8
Neptune               9
Ceres                 5
Pluto                10

### Get index of row

In [12]:
print(solar_system.index[0])

Sun

### Loop through dataframe

In [13]:
for index, row in solar_system.iterrows():
    print(row['Type'], row['Mass'])

Star 333000.0
Terrestrial planet 0.055
Terrestrial planet 0.815
Terrestrial planet 1.0
Terrestrial planet 0.107
Gas giant 318.0
Gas giant 95.0
Gas giant 15.0
Gas giant 17.0
Dwarf planet 0.00016
Dwarf planet 0.002
Dwarf planet 0.0007
Dwarf planet 0.00067
Dwarf planet 0.0028

## 6, Modify Data

### delete row using index, col
```
df.drop([index_list]))
df.drop([column_list], axis = 1)
```

In [14]:

m = np.random.rand(5,3)
df = pd.DataFrame(m, columns=['a', 'b', 'c'], index=['A','B','C','D','E'])
df.iloc[:, 2] = 2
df

          a         b  c
A  0.562205  0.528560  2
B  0.202138  0.968834  2
C  0.539917  0.022196  2
D  0.091753  0.358568  2
E  0.925872  0.615933  2

## 7, Add column using math

In [15]:
import math
planets['volume'] = 3/4 * math.pi * planets['diameter'] ** 3
planets

             mass  diameter  gravity   period        volume
Mercury     0.330    4879.0      3.7     88.0  2.736551e+11
Venus       4.870   12104.0      8.9    224.7  4.178283e+12
Earth       5.970   12756.0      9.8    365.2  4.890516e+12
Mars        0.642    6792.0      3.7    687.0  7.382512e+11
Jupiter  1898.000  142984.0     23.1   4331.0  6.887688e+15
Saturn    568.000  120536.0      9.0  10747.0  4.126306e+15
Uranus     86.800   51118.0      8.7  30589.0  3.147261e+14
Neptune   102.000   49528.0     11.0  59800.0  2.862619e+14

## 8, Grouping data and Aggregation

One of the most powerful uses for dataframes is to reorganize your data into groups and perform data aggregations.

<img src = "https://1.bp.blogspot.com/-4kPLaL_ykYM/Xzv418A9VzI/AAAAAAAACzQ/JMnqh6dUdkU7GqS8TaFkxeE68zFsUCJQACLcBGAsYHQ/s0/Screenshot%2Bfrom%2B2020-08-18%2B22-49-41.png">

In [16]:
solar_system

                        Type  Order from Sun   Diameter          Mass
Name
Sun                     Star               0  1392000.0  333000.00000
Mercury   Terrestrial planet               1     4878.0       0.05500
Venus     Terrestrial planet               2    12104.0       0.81500
Earth     Terrestrial planet               3    12756.0       1.00000
Mars      Terrestrial planet               4     6787.0       0.10700
Jupiter            Gas giant               6   142800.0     318.00000
Saturn             Gas giant               7   120000.0      95.00000
Uranus             Gas giant               8    51118.0      15.00000
Neptune            Gas giant               9    49528.0      17.00000
Ceres           Dwarf planet               5      974.6       0.00016
Pluto           Dwarf planet              10     2300.0       0.00200
Haumea          Dwarf planet              11     1300.0       0.00070
Makemake        Dwarf planet              12     1420.0       0.00067
Eris            Dwarf planet              13     2326.0       0.00280

In [17]:
# Create groupby object
group_by_type = solar_system.groupby('Type')
group_by_type

In [18]:
group_by_type.get_group('Dwarf planet')

                  Type  Order from Sun  Diameter     Mass
Name
Ceres     Dwarf planet               5     974.6  0.00016
Pluto     Dwarf planet              10    2300.0  0.00200
Haumea    Dwarf planet              11    1300.0  0.00070
Makemake  Dwarf planet              12    1420.0  0.00067
Eris      Dwarf planet              13    2326.0  0.00280

### Iteration over groups

In [19]:
for (Type, group) in solar_system.groupby('Type'):
    print(Type, group.shape)

Dwarf planet (5, 4)
Gas giant (4, 4)
Star (1, 4)
Terrestrial planet (4, 4)

In [20]:
# get sum, max, min of each of 4 type 
group_by_type.sum()

                    Order from Sun   Diameter          Mass
Type
Dwarf planet                    51     8320.6       0.00633
Gas giant                       30   363446.0     445.00000
Star                             0  1392000.0  333000.00000
Terrestrial planet              10    36525.0       1.97700

## 9, Filtering a Dataframe

Data in dataframes can also be filtered using boolean operations.

In [21]:
solar_system

                        Type  Order from Sun   Diameter          Mass
Name
Sun                     Star               0  1392000.0  333000.00000
Mercury   Terrestrial planet               1     4878.0       0.05500
Venus     Terrestrial planet               2    12104.0       0.81500
Earth     Terrestrial planet               3    12756.0       1.00000
Mars      Terrestrial planet               4     6787.0       0.10700
Jupiter            Gas giant               6   142800.0     318.00000
Saturn             Gas giant               7   120000.0      95.00000
Uranus             Gas giant               8    51118.0      15.00000
Neptune            Gas giant               9    49528.0      17.00000
Ceres           Dwarf planet               5      974.6       0.00016
Pluto           Dwarf planet              10     2300.0       0.00200
Haumea          Dwarf planet              11     1300.0       0.00070
Makemake        Dwarf planet              12     1420.0       0.00067
Eris            Dwarf planet              13     2326.0       0.00280

In [22]:
solar_system[solar_system['Order from Sun'] > 3].iloc[:, 1]

Name
Mars         4
Jupiter      6
Saturn       7
Uranus       8
Neptune      9
Ceres        5
Pluto       10
Haumea      11
Makemake    12
Eris        13
Name: Order from Sun, dtype: int64

## 10, Concat and Append row

### Concat

In [23]:
def make_df(cols, ind):
    """Quickly make a DataFrame"""
    data = {c: [str(c) + str(i) for i in ind]
    for c in cols}
    return pd.DataFrame(data, ind)

In [24]:
# thêm vào theo hướng ngang dọc bảng default axis = 0 
df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])
print(df1); print(df2); print(pd.concat([df1, df2]))

A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [25]:
# thêm vào theo hướng ngang bảng axis = 1
df3 = make_df('AB', [0, 1])
df4 = make_df('CD', [0, 1])
print(df3); print(df4); print(pd.concat([df3, df4], axis=1))

A   B
0  A0  B0
1  A1  B1
    C   D
0  C0  D0
1  C1  D1
    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

In [26]:
# Handle duplicate index
x = make_df('AB', [0, 1])
y = make_df('AB', [2, 3])
y.index = x.index
print(pd.concat([x, y]))

#ignore_index bool, default False, if True, the resulting will be labeled 0, 1, …, n - 1.
print(pd.concat([x, y], ignore_index = True))

A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3
    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [27]:
# concatenation with join 
df5 = make_df('ABC', [1, 2])
df6 = make_df('BCD', [3, 4])
print(df5); print(df6); 
# Default: thấy cột mới thì tự thêm vào
print(pd.concat([df5, df6]))
# Inner join: chỉ lấy data các cột chung trong 2 df
print(pd.concat([df5, df6], join = 'inner'))
# Tự chọn các cột 
print(pd.concat([df5, df6], join_axes=[df5.columns]))

A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4
    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4
     A   B   C
1   A1  B1  C1
2   A2  B2  C2
3  NaN  B3  C3
4  NaN  B4  C4

### Append

In [28]:
df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])

# tương tự như concat([df1, df2]))
# Keep in mind that unlike the append() and extend() methods of Python lists, the append() method in Pandas does not modify the original object—instead, it creates a new object with the combined data => tốn time vcl => nên tạo list df trước rồi concat cùng lúc OR tạo list data rồi cho vào một df

df1.append(df2) 
# df1 ko đổi 
print(df1)
# bùm, thay đổi 
df1 = df1.append(df2)
print(df1)

A   B
1  A1  B1
2  A2  B2
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

## 11, Handle missing data
<a href = "https://lh3.googleusercontent.com/-bnfvGw0aqGQ/X29DbJzlgRI/AAAAAAAAC8o/etpToEC7Hh0Vlvc9SeV1lWBbZYTXVzoSACLcBGAsYHQ/image.png">Pandas handling of NAs by type</a>

### Python missing data - None

In [49]:
# dtype = object 
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

In [54]:
# aggregate retrieve error
vals1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

In [52]:
# tốc độ khá chậm in comparision with int 
for dtype in ['object', 'int']:
    print("dtype =", dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

dtype = object
69.1 ms ± 3.04 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype = int
2.38 ms ± 141 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

### NaN - Not a Number: numerical missing data 
There is no NaN for int, string,... Only for float

In [67]:
vals2 = np.array([1, np.nan, 3, 4])
vals2.dtype, vals2

(dtype('float64'), array([ 1., nan,  3.,  4.]))

In [63]:
# aggregate retrieve nan
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

In [69]:
# special method to work with nan
np.nanmax(vals2)

4.0

In [70]:
# in addition to casting the integer array to floating point, Pandas automatically converts the None to a NaN value
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int64

In [71]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

In [74]:
y = pd.Series([1, 2, None])
y

0    1.0
1    2.0
2    NaN
dtype: float64

### Operating on null values

In [80]:
# isnull() - notnull(): detect null value 
data = pd.Series([1, np.nan, 'hi', None])
data.isnull(), data.notnull()

(0    False
 1     True
 2    False
 3     True
 dtype: bool,
 0     True
 1    False
 2     True
 3    False
 dtype: bool,
 0     1
 2    hi
 dtype: object)

In [82]:
## pick nhanh các ô null trong Series (Df ko đc)
data[data.isnull()]

1     NaN
3    None
dtype: object

In [87]:
# dropna(): dropping null value 
df = pd.DataFrame([[1,np.nan, 2, np.nan],[2,3,5,np.nan],[np.nan, 4, 6,np.nan]])

# drop all columns with null value 
df.dropna(axis = 1)

# kept all rows has >= 3 not-null value
df.dropna(axis = 0, thresh = 3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [92]:
# fillna(): fill null value with something
df.fillna(2001, axis = 1)

(     0    1    2   3
 0  1.0  2.0  2.0 NaN
 1  2.0  3.0  5.0 NaN
 2  4.0  4.0  6.0 NaN,)

In [97]:
# fill giống thằng liền trước theo cột (đhs index lại thành cột)
df, df.fillna(method='ffill', axis='index')

(     0    1  2   3
 0  1.0  NaN  2 NaN
 1  2.0  3.0  5 NaN
 2  NaN  4.0  6 NaN,
      0    1  2   3
 0  1.0  NaN  2 NaN
 1  2.0  3.0  5 NaN
 2  2.0  4.0  6 NaN)

In [98]:
# fill giống thằng liên sau theo hàng (đhs columns lại thanh hàng)
df, df.fillna(method='bfill', axis='columns')

(     0    1  2   3
 0  1.0  NaN  2 NaN
 1  2.0  3.0  5 NaN
 2  NaN  4.0  6 NaN,
      0    1    2   3
 0  1.0  2.0  2.0 NaN
 1  2.0  3.0  5.0 NaN
 2  4.0  4.0  6.0 NaN)

# Stuff 
1. convert str to dict
```
 import json
 dictionary = json.loads(string)
```